
//=============================================================================//
// 
// Name : GameTeture.h
// Describe : ゲームテクスチャ処理
// Author : 
// Create Date : 2018/05/01
// Modify Date : 2018/06/05
//=============================================================================//
#ifndef _GAMETEXTURE_H_
#define _GAMETEXTURE_H_

//*****************************************************************************//
// (1) インクルードファイル
//*****************************************************************************//
#include "D3DUtility.h"				// Directx9インクルードファイル処理

#include "ScreenTexture.h"			// スクリーンテクスチャ処理
//*****************************************************************************//
// (2) マクロ定義
//*****************************************************************************//
#define	MAXNUM_GAMETEXTURE		(100)				// 最大テクスチャ数

//*****************************************************************************//
// (3) ユーザー定義データ型
//*****************************************************************************//

// { 列挙型 }

// { 構造体 }

// { クラス }
// ゲームテクスチャクラス
class GTexture : public BScreenTexture
{
private:
	LPDIRECT3DDEVICE9			pDevice; 				// デバイスオブジェクト
public:
	bool						bUpdate;				// 更新フラグ
	bool						bRender;				// 描画フラグ
public:
	GTexture(LPDIRECT3DDEVICE9 D3dDevice);				// コンストラクタ
	~GTexture();										// デストラクタ
public:
	HRESULT InitGameTexture(D3DXVECTOR2 size, D3DXVECTOR2 position);// ゲームテクスチャ初期化
	VOID UpdateGameTexture();										// ゲームテクスチャ更新
	VOID RenderGameTexture(LPDIRECT3DTEXTURE9 texture);				// ゲームテクスチャ描画
};

//*****************************************************************************//
// (4) プロトタイプ宣言(外部でも使える関数)
//*****************************************************************************//

#endif