
//=============================================================================//
// 
// Name : Mesh.h
// Describe : メッシュ処理
// Author : 
// Create Date : 2018/05/01
// Modify Date : 2018/06/05
//=============================================================================//
#ifndef _MESH_H_
#define _MESH_H_

//*****************************************************************************//
// (1) インクルードファイル
//*****************************************************************************//
#include "D3DUtility.h"				// Directx9インクルードファイル処理

#include "Xfile.h"					// xファイル処理
#include "WorldTransform.h"			// ワールドトランスフォーム処理
//*****************************************************************************//
// (2) マクロ定義
//*****************************************************************************//
#define	MAXNUM_MESH		(50)					// 最大メッシュ数

//*****************************************************************************//
// (3) ユーザー定義データ型
//*****************************************************************************//

// { 列挙型 }

// { 構造体 }

// { クラス }

// メッシュクラス
class BMesh : public WorldTransform
{
private:
	LPDIRECT3DDEVICE9		pDevice;				// デバイスオブジェクト
public:
	bool		bUpdate;							// 更新フラグ
	bool		bRender;							// 描画フラグ
public:
	BMesh(LPDIRECT3DDEVICE9 D3dDevice);				// コンストラクタ
	~BMesh();										// デストラクタ

public:
	VOID UpdateMesh();								// メッシュ更新
	VOID RenderMesh();								// メッシュ描画
	VOID RenderMesh(SXfile* xfile);					// メッシュ描画(xファイル)
	VOID RenderSelectMesh(int Num, SXfile* xfile);	// メッシュ描画(xファイル)番号
};
//*****************************************************************************//
// (4) プロトタイプ宣言(外部でも使える関数)
//*****************************************************************************//

#endif