
//=============================================================================//
// 
// Name : XA2SourceVoice.h
// Describe : XAudio2ソースボイス処理
// Author : 
// Create Date : 2018/05/01
// Modify Date : 2018/06/05
//=============================================================================//
#ifndef _XA2SOURCEVOICE_H_
#define _XA2SOURCEVOICE_H_

//*****************************************************************************//
// (1) インクルードファイル
//*****************************************************************************//
#include "D3DUtility.h"				// Directx9インクルードファイル処理

#include "Sound.h"					// サウンド処理
#include "Wavfile.h"				// Wavファイル処理
//*****************************************************************************//
// (2) マクロ定義
//*****************************************************************************//
#define	MAXNUM_SOURCEVOICE			(50)					// 最大XA2ソースボイス数

//*****************************************************************************//
// (3) ユーザー定義データ型
//*****************************************************************************//

// { 列挙型 }

// { 構造体 }

// { クラス }

// メッシュクラス
class BXA2SourceVoice
{
private:
	XAUDIO2_BUFFER			XA2buffer;				// XAUDIO2バッファ
	IXAudio2SourceVoice*	pSourceVoice;			// ソースボイス
public:
	bool					bLoop;					// ループフラグ
public:
	BXA2SourceVoice();								// コンストラクタ
	~BXA2SourceVoice();								// デストラクタ
public:
	HRESULT InitSourceVoice(SWavfile* wavfile, bool loop);		// ソースボイスの初期化

	VOID PlaySourceVoice();										// セグメント再生
	VOID RestartSourceVoice();									// セグメント初期再生
	VOID PauseSourceVoice();									// セグメント一時停止
	VOID StopSourceVoice();										// セグメント停止
};
//*****************************************************************************//
// (4) プロトタイプ宣言(外部でも使える関数)
//*****************************************************************************//

#endif